export default {
  test: 'זוהי בדיקה',
  testWithNum: 'זה בדיקה עם מספר {0}',
  chooseLanguage: 'בחר שפה',
  errorPopularOnYoutube: 'שגיאה בטעינת סרטונים פופולריים',
  supportInfo: 'מידע מהתמיכה',
  testConfirmModalDate: 'בחר תאריך',
  fromDate: 'מתאריך',
  no: 'לא',
  yes: 'כן',
  continue: 'המשך',
  update: 'עדכן',
  error: 'שגיאה',
  success: 'הצלחה',
  cancel: 'ביטול',
  info: 'מידע',
  warning: 'אזהרה',
  warningTitle: 'אזהרה',
  successTitle: 'הצלחה',
  errorTitle: 'שגיאה',
  errorTranslate: 'שגיאה בנסיון תרגום',
  // home page
  homeText: 'האתר שלנו מציע פתרון מהיר וחינמי לבעית חלוקה הוגנת (עם מספר פריטים משותפים  מינימליים)  , תוך שימוש באלגוריתם שפותח ע"י טובי המוחות בתחום מדעי המחשב וכלכלה.',
  homeTextTitle: 'פתרונות חלוקה הוגנת',
  home: 'בית',
  about: 'אודות',
  divideGoods: 'חלוקת פריטים',
  explanations: 'הסבר',
  // divide goods page
  objectsNames: 'שמות הפריטים',
  evaluations: 'הערכות',
  participantsNames: 'שמות המשתתפים',
  goBack: 'חזור אחורה',
  inputError: 'אחד או יותר משדות הקלט לא חוקיים',
  resultAreReady: 'התוצאות מוכנות - ניתן לצפות בהם בלחיצה על הכפתור "צפה בתוצאות"',
  envyFree: 'חלוקה ללא קנאה',
  proportional: 'חלוקה פרופרציונלית',
  howDoesTheAlgoWork: 'האלגוריתם שלנו מציע חלוקה בין שני אנשים או יותר. אתם מתחילים במתן רשימה של פריטים שברצונכם לחלק ורשימת משתתפים. ואז כל משתתף מציין כמה הוא מאמין שכל פריט שווה. ולבסוף אתם בוחרים את סוג החלוקה שאתם רוצים (ללא קנאה או פרופורציונלית) . האלגוריתם שלנו משתמש בהערכות אלה כדי להציע חלוקה הוגנת של הפריטים בין המשתתפים.',
  // errors
  minLengthError: 'המספר קטן מידי',
  maxLengthError: 'המספר גדול מידי',
  invalidNumber: 'מספר לא חוקי',
  requiredField: 'שדה חובה',
  algoError: 'אירעה שגיאה בעת שליחת האלגוריתם',
  send: 'שלח',
  areYouSureCancel: 'האם אתה בטוח שברצונך לצאת? כל הנתונים ימחקו',
  startAlgo: 'התחל את האלגוריתם',
  viewResult: 'צפה בתוצאות',
  participantsEvaluations: 'הערכות המשתתפים',
  generalResult: 'תוצאות כלליות',
  explanation: 'הסבר',
  hisShare: 'החלק של {0} לפי הערכה של {1} הוא {2} ({3})',
  envyFreeConclusion: 'ניתן לראות כי לפי הערכה של {0} החלק שלו הוא גדול או שווה לכל האחרים ולכן {1} לא מקנא באף אחד!',
  proportionalConclusion: 'ניתן לראות כי לפי הערכה של {0} החלק שלו הוא גדול או שווה ל{1} ולכן מבחינת {2} זו חלוקה פרופרצינלית!',
  eliahuName: 'אליהו סתת',
  eliahuTitle: 'מתכנת',
  eliahuDescription: 'אליהו סתת קיבל תואר B.S. במדעי המחשב מאוניברסיטת אריאל בשנת 2021. את פרוייקט הגמר שלו הוא עשה אצל ד"ר אראל סגל - במימוש אלגוריתם לחלוקה הוגנת בשפת פייתון.\n' +
    'לאחר סיום לימודיו החליט לבנות את אתר לאלגוריתם שמימש בתור פרוייקט אישי.',
  explanationParagraph1: '<h2 style="color: #2e6c80;">מושגים כללים והסבר:</h2>\n' +
    '<p>האתר שלנו מציע 2 אפשרויות חלוקה :<br /><b>חלוקה פרופרציונלית</b> <b>וחלוקה ללא קנאה.</b><br /><b>חלוקה פרופרציונלית</b> היא חלקוה בה כל משתתף מקבל לפי הערכה שלו לפחות 1\\ (מספר המשתתפים) מסך שווי הפריטים שמשתתפים בחלוקה.<br /><b>חלוקה ללא קנאה</b>היא חלוקה שבה כל משתתף מרגיש (לפי הערכה שלו ) שהוא קיבל חלק שלא קטן מאף חלק של שאר המשתתפים.<br />נשמע מבלבל?<br />בואו נראה דוגמא פשוטה שתסביר הכל :\n' +
    'נניח שיש לנו שלושה אחים עמי רמי ותמי שקיבלו בירושה שלושה דירות (דירת קרקע , פנטהאוס ויחידת דיור) והם רוצים לחלק אותם בין שלושתם כך שכולם יהיו מרוצים.<br />\n' +
    'מאחר וערך של דברים זה דבר סובייקטיבי וכל אחד רואה את הדברים בצורה שונה – כל משתתף צריך להעריך כמה כל אחד מהחפצים שמשתתפים בחלוקה שווה בעיניו.<br />\n' +
    'אז לצורך הדוגמא שלנו נניח שככה כל אחד מהאחים בעריך את הדירות:<br />\n' +
    '</p>',
  housingUnit: 'יחידת דיור',
  penthouse: 'פנטהאוס',
  privateHouse: 'בית פרטי',
  name: 'שם',
  Hami: 'עמי',
  Tami: 'תמי',
  Rami: 'רמי',
  explanationParagraph2: '<p>כלומר עמי מעריך את דירת הקרקע ב400 אלף את הפנטהאוס ב חצי מליון ואת יחידת הדיור ב100 אלף וכו..<br />\n' +
    'אז נראה דוגמא לחלוקה פרופרציונלית:<br />\n' +
    '</p>',
  explanationParagraph3: '<p>\n' +
   'נשים לב שזו אכן לחלוקה פרופרציונלית <br />\n' +
   'עמי מקבל את כל הפנטהאוס ובעיניו זה שווה 500 שזה יותר מ333 (1\\3 מתוך 1000 שזה סכום כל הפריטים לחלוקה) <br />\n' +
   'החלק של תמי בעיניה הוא 454.2 שזה יותר מ 333<br />\n' +
   'החלק של רמי בעיניו הוא 407.95 שזה יותר מ333<br />\n' +
   'נשים לב שזאת לא חלוקה ללא קנאה כי רמי מקנאה בתמי – לפני הערכה של רמי החלק שלו הוא 407.95 אבל לפי הערכה שלו החלק של תמי הוא 492 ולכן הוא מקנאה בה.<br />\n' +
   'ועכשיו נראה דוגמא לחלוקה ללא קנאה :<br />\n' +
   '</p>',
  explanationParagraph4: '<p>\n' +
    '  למה זאת חלוקה ללא קנאה:<br />\n' +
    'לפי הערכה של עמי :<br />\n' +
    'החלק של עמי : 1*500 = 500<br />\n' +
    'החלק של תמי : 0.65*400 = 260<br />\n' +
    'החלק של רמי = 0.35*400 + 1*100 = 240<br />\n' +
    'כמו שאפשר לראות עמי לא מקנא.<br /><br />\n' +
    '\n' +
    'לפי הערכה של תמי :<br />\n' +
    'החלק של עמי : 1*300 = 300<br />\n' +
    'החלק של תמי : 0.65*600 = 390<br />\n' +
    'החלק של רמי = 0.35*600 + 1*100 = 310<br />\n' +
    'כמו שאפשר לראות תמי לא מקנא.<br /><br />\n' +
    '\n' +
    'לפי הערכה של רמי :<br />\n' +
    'החלק של עמי : 1*100 = 100<br />\n' +
    'החלק של תמי : 0.65*650 = 422.5<br />\n' +
    'החלק של רמי = 0.35*650 + 1*250 = 477.5<br />\n' +
    'כמו שאפשר לראות רמי לא מקנא.<br /><br />\n' +
    'ולכן זאת חלוקה ללא קנאה . <br />נשים לב שבשני החלוקות רק הדירת קרקע מתחלקת בין רמי ותמי והאלגוריתם שלנו מבטיח שזאת האפשרות המינימלית – כלומר אין אפשרות לחלק את הפריטים האלה לפי הערכה הזאת ללא קנאה עם פחות פריטים משותפים.<br />\n' +
    '<br />\n' +
    '</p>'
}
